OpenNuvoton/M55M1BSP/Library/StdDriver/src/clk.c
    u32Hclk0Freq = CLK_GetHCLK0Freq();

    u32Freq = u32Hclk0Freq / (((CLK->PCLKDIV & CLK_PCLKDIV_PCLK0DIV_Msk) >> CLK_PCLKDIV_PCLK0DIV_Pos) + 1UL);

    return u32Freq;
}

/**
  * @brief      Get PCLK1 frequency
  * @param      None
  * @return     PCLK1 frequency
  * @details    This function get PCLK1 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK1Freq(void)
{
    uint32_t u32Freq;
    uint32_t u32Hclk1Freq;

    u32Hclk1Freq = CLK_GetHCLK0Freq();

    u32Freq = u32Hclk1Freq / (((CLK->PCLKDIV & CLK_PCLKDIV_PCLK1DIV_Msk) >> CLK_PCLKDIV_PCLK1DIV_Pos) + 1UL);

    return u32Freq;
}

/**
  * @brief      Get PCLK2 frequency
  * @param      None
  * @return     PCLK2 frequency
  * @details    This function get PCLK2 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK2Freq(void)
{
    uint32_t u32Freq;
    uint32_t u32Hclk2Freq;

    u32Hclk2Freq = CLK_GetHCLK0Freq();

    u32Freq = u32Hclk2Freq / (((CLK->PCLKDIV & CLK_PCLKDIV_PCLK2DIV_Msk) >> CLK_PCLKDIV_PCLK2DIV_Pos) + 1UL);

    return u32Freq;
}

/**
  * @brief      Get PCLK3 frequency
  * @param      None
  * @return     PCLK3 frequency
  * @details    This function get PCLK3 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK3Freq(void)
{
    uint32_t u32Freq;
    uint32_t u32Hclk3Freq;

    u32Hclk3Freq = CLK_GetHCLK0Freq();

    u32Freq = u32Hclk3Freq / (((CLK->PCLKDIV & CLK_PCLKDIV_PCLK3DIV_Msk) >> CLK_PCLKDIV_PCLK3DIV_Pos) + 1UL);

    return u32Freq;
}

/**
  * @brief      Get PCLK4 frequency
  * @param      None
  * @return     PCLK4 frequency
  * @details    This function get PCLK4 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK4Freq(void)
{
    uint32_t u32Freq;
    uint32_t u32Hclk4Freq;

    u32Hclk4Freq = CLK_GetHCLK2Freq();

    u32Freq = u32Hclk4Freq / (((CLK->PCLKDIV & CLK_PCLKDIV_PCLK4DIV_Msk) >> CLK_PCLKDIV_PCLK4DIV_Pos) + 1UL);

    return u32Freq;
}

/**
  * @brief      Get PCLK5 frequency
  * @param      None
  * @return     PCLK5 frequency
  * @details    This function get PCLK5 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetPCLK5Freq(void)
{
    uint32_t u32Freq;

    u32Freq = CLK_GetACLKFreq();

    return u32Freq;
}

/**
  * @brief      Get SCLK frequency
  * @param      None
  * @return     SCLK frequency
  * @details    This function get SCLK frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetSCLKFreq(void)
{
    (void)CLK_SystemClockUpdate();

    return SystemCoreClock;
}

/**
  * @brief      Get ACLK frequency
  * @param      None
  * @return     ACLK frequency
  * @details    This function get ACLK frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetACLKFreq(void)
{
    (void)SystemCoreClockUpdate();

    return SystemCoreClock;
}

/**
  * @brief      Get HCLK0 frequency
  * @param      None
  * @return     HCLK0 frequency
  * @details    This function get HCLK0 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetHCLK0Freq(void)
{
    uint32_t u32Hclk0;

    u32Hclk0 = CLK_SystemClockUpdate();

    return u32Hclk0;
}

/**
  * @brief      Get HCLK1 frequency
  * @param      None
  * @return     HCLK1 frequency
  * @details    This function get HCLK1 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetHCLK1Freq(void)
{
    uint32_t u32Hclk1;

    u32Hclk1 = CLK_SystemClockUpdate();

    return u32Hclk1;
}

/**
  * @brief      Get HCLK2 frequency
  * @param      None
  * @return     HCLK2 frequency
  * @details    This function get HCLK2 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetHCLK2Freq(void)
{
    uint32_t u32SclkFreq;
    uint32_t u32Hclk2;
    uint32_t u32Hclk2Div;

    u32SclkFreq = CLK_SystemClockUpdate();

    u32Hclk2Div = ((CLK->HCLKDIV & CLK_HCLKDIV_HCLK2DIV_Msk) >> CLK_HCLKDIV_HCLK2DIV_Pos) + 1UL;

    /* Update System Core Clock */
    u32Hclk2 = u32SclkFreq / u32Hclk2Div;

    return u32Hclk2;
}

/**
  * @brief      Set ACLK frequency
  * @param[in]  u32Aclk is ACLK frequency. The range of u32Hclk is 36MHz ~ 220MHz.
  * @return     ACLK frequency
  * @details    This function is used to set ACLK frequency by using PLL. The frequency unit is Hz. \n
  *             Power level and flash access cycle are also set according to ACLK frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_SetCoreClock(uint32_t u32Aclk)
{
    uint32_t u32HIRCSTB;
    uint32_t u32TimeOutCount;
    uint32_t u32AclkTemp;

    /* Read HIRC clock source stable flag */
    u32HIRCSTB = CLK->STATUS & CLK_STATUS_HIRCSTB_Msk;

    /* Check ACLK frequency range is 36MHz ~ 220MHz */
    if (u32Aclk > FREQ_220MHZ)
    {
        u32AclkTemp = FREQ_220MHZ;
    }
    else if (u32Aclk < FREQ_36MHZ)
    {
        u32AclkTemp = FREQ_36MHZ;
    }
    else
    {
        u32AclkTemp = u32Aclk;
    }

    /* Switch SCLK clock source to HIRC clock for safe */
    CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;
    (void)CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
    CLK->SCLKSEL = (CLK->SCLKSEL & (~CLK_SCLKSEL_SCLKSEL_Msk)) | CLK_SCLKSEL_SCLKSEL_HIRC;

    u32TimeOutCount = SystemCoreClock; /* 1 second time-out */

    while (!(CLK->STATUS & CLK_STATUS_SCLKSWF_Msk))
    {
        if (u32TimeOutCount-- == 0)
        {
            break;
        }
    }

    /* Configure PLL setting if HXT clock is stable */
    if (CLK->STATUS & CLK_STATUS_HXTSTB_Msk)
    {
        u32AclkTemp = CLK_EnableAPLL(CLK_APLLCTL_APLLSRC_HXT, u32AclkTemp, CLK_APLL0_SELECT);
    }
    /* Configure PLL setting if HXT clock is not stable */
    else
    {
        u32AclkTemp = CLK_EnableAPLL(CLK_APLLCTL_APLLSRC_HIRC, u32AclkTemp, CLK_APLL0_SELECT);

        /* Read HIRC clock source stable flag */
        u32HIRCSTB = CLK->STATUS & CLK_STATUS_HIRCSTB_Msk;
    }

    /* Select SCLK clock source to PLL,
       select ACLK clock source divider as 1,
       adjust power level, flash access cycle and update system core clock
    */
    CLK_SetSCLK(CLK_SCLKSEL_SCLKSEL_APLL0);

    /* Disable HIRC if HIRC is disabled before setting core clock */
    if (u32HIRCSTB == 0UL)
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_HIRCEN_Msk;
    }

    /* Return actually ACLK frequency is PLL frequency divide 1 */
    return u32AclkTemp;
}

/**
  * @brief      Set SCLK clock source
  * @param[in]  u32ClkSrc is SCLK clock source. Including :
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_MIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC48M
  *             - \ref CLK_SCLKSEL_SCLKSEL_HXT
  *             - \ref CLK_SCLKSEL_SCLKSEL_APLL0
  * @return     None
  * @details    This function set SCLK clock source. \n
  *             Power level and flash access cycle are also set according to ACLK operation frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_SetSCLK(uint32_t u32ClkSrc)
{
    uint32_t u32HIRCSTB;
    uint32_t u32TimeOutCount;

    /* Read HIRC clock source stable flag */
    u32HIRCSTB = CLK->STATUS & CLK_STATUS_HIRCSTB_Msk;

