OpenNuvoton/M55M1BSP/Library/StdDriver/src/clk.c
  * |\ref UART0_MODULE   |\ref CLK_UARTSEL0_UART0SEL_HIRC48M        |\ref CLK_UARTDIV0_UART0DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HXT            |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HIRC           |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_LXT            |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART1_MODULE   |\ref CLK_UARTSEL0_UART1SEL_HIRC48M        |\ref CLK_UARTDIV0_UART1DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HXT            |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HIRC           |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_LXT            |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART2_MODULE   |\ref CLK_UARTSEL0_UART2SEL_HIRC48M        |\ref CLK_UARTDIV0_UART2DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HXT            |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HIRC           |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_LXT            |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART3_MODULE   |\ref CLK_UARTSEL0_UART3SEL_HIRC48M        |\ref CLK_UARTDIV0_UART3DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HXT            |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HIRC           |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_LXT            |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HIRC48M        |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC           |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_LXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC48M        |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC           |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_LXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC48M        |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC           |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_LXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC48M        |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC           |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_LXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC48M        |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC           |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_LXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC48M        |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LXT               | x                              |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LIRC              | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LXT               | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LIRC              | x                              |
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_LXT             | x                              |
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_LIRC            | x                              |
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_LXT             | x                              |
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_LIRC            | x                              |
  */
void CLK_SetModuleClock(uint64_t u64ModuleIdx, uint32_t u32ClkSrc, uint32_t u32ClkDiv)
{
    /* Configure clock source divider */
    if (MODULE_CLKDIV_Msk(u64ModuleIdx) != MODULE_NoMsk)
    {
        uint32_t u32Div;

