OpenNuvoton/M55M1BSP/Library/StdDriver/src/clk.c
    u32TmpAddr = (uint32_t)MODULE_CLKCTL_BASE + (uint32_t)(MODULE_CLKCTL(u64ModuleIdx) << 2);

    *(volatile uint32_t *)u32TmpAddr &= u32TmpVal;
}

/**
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_APLLCTL_APLLSRC_HXT
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC48_DIV4
  * @param[in]  u32PllFreq is PLL frequency. The range of u32PllFreq is 36 MHz ~ 500 MHz.
  * @param[in]  u32PllSelect is PLL selection. Including :
  *             - \ref CLK_APLL0_SELECT
  *             - \ref CLK_APLL1_SELECT
  * @return     PLL frequency
  * @details    This function is used to configure PLLCTL register to set specified PLL frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_EnableAPLL(uint32_t u32PllClkSrc, uint32_t u32PllFreq, uint32_t u32PllSelect)
{
    uint32_t u32PllSrcClk;
    uint32_t u32PllClk;
    uint32_t u32StableSel;
    const uint8_t au8NoTbl[4] = {1U, 2U, 2U, 4U};

    /* Disable PLL first to avoid unstable when setting PLL */
    if (u32PllSelect == CLK_APLL0_SELECT)
    {
        CLK_DisableAPLL(CLK_APLL0_SELECT);
    }
    else
    {
        CLK_DisableAPLL(CLK_APLL1_SELECT);
    }

    /* PLL source clock is from HXT */
    if (u32PllClkSrc == CLK_APLLCTL_APLLSRC_HXT)
    {
        /* Enable HXT clock */
        CLK->SRCCTL |= CLK_SRCCTL_HXTEN_Msk;

        /* Wait for HXT clock ready */
        (void)CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

        /* Select PLL source clock from HXT */
        u32PllSrcClk = __HXT;
    }
    /* PLL source clock is from HIRC */
    else if (u32PllClkSrc == CLK_APLLCTL_APLLSRC_HIRC)
    {
        /* Enable HIRC clock */
        CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;

        /* Wait for HIRC clock ready */
        (void)CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

        /* Select PLL source clock from HIRC */
        u32PllSrcClk = __HIRC;
    }
    else /* PLL source clock is from HIRC48M */
    {
        /* Enable HIRC48M clock */
        CLK->SRCCTL |= CLK_SRCCTL_HIRC48MEN_Msk;

        /* Wait for HIRC48M clock ready */
        (void)CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);

        /* Select PLL source clock from HIRC48M/4 */
        u32PllSrcClk = __HIRC48M / 4UL;
    }

    /* Select APLL stable count */
    if (u32PllSrcClk == FREQ_4MHZ)
    {
        u32StableSel = CLK_APLLCTL_STBSEL_820;
    }
    else if ((u32PllSrcClk > FREQ_4MHZ) && (u32PllSrcClk <= FREQ_12MHZ))
    {
        u32StableSel = CLK_APLLCTL_STBSEL_2460;
    }
    else /* ((u32PllSrcClk > FREQ_12MHZ) && (u32PllSrcClk <= FREQ_24MHZ)) */
    {
        u32StableSel = CLK_APLLCTL_STBSEL_4920;
    }

    /* Check PLL frequency range */
    /* Constraint 1: 36MHz < FOUT < 500MHz */
    if ((u32PllFreq <= FREQ_500MHZ) && (u32PllFreq >= FREQ_36MHZ))
    {
        uint32_t u32NR;
        uint32_t u32NF;
        uint32_t u32NO;
        uint32_t u32FRDIV;
        uint32_t u32Min;
        uint32_t u32MinNF;
        uint32_t u32MinNR;
        uint32_t u32MinFRDIV;
        uint32_t u32BestFreq = 0UL;

        /* Select "NO" according to request frequency */
        if ((u32PllFreq < FREQ_72MHZ) && (u32PllFreq >= FREQ_36MHZ))
        {
            u32NO = 3UL;
        }
        else if ((u32PllFreq <= FREQ_220MHZ) && (u32PllFreq >= FREQ_72MHZ))
        {
            u32NO = 1UL;
        }
        else
        {
            u32NO = 0UL;
        }

        /* Find best solution */
        u32Min = (uint32_t) - 1;    /* initial u32Min to max value of uint32_t (0xFFFFFFFF) */
        u32MinNR = 0UL;
        u32MinNF = 0UL;
        u32MinFRDIV = 0UL;

        for (u32FRDIV = 0UL; u32FRDIV <= 4095UL; u32FRDIV++)  /* FRDIV = 0~4095 */
        {
            /* Break when get good results */
            if (u32Min == 0UL)
            {
                break;
            }

            for (u32NR = 1UL; u32NR <= 32UL; u32NR++)  /* max NR = 32 since NR = INDIV+1 and INDIV = 0~31 */
            {
                uint32_t u32Tmp;

                u32Tmp = u32PllSrcClk / u32NR;  /* FREF = FIN/NR */

                if ((u32Tmp >= FREQ_4MHZ) && (u32Tmp <= FREQ_8MHZ)) /* Constraint 2: 4MHz < FREF < 8MHz. */
                {
                    for (u32NF = 12UL; u32NF <= 255UL; u32NF++)     /* NF = 12~255 since NF = FBDIV+2 and FBDIV = 10~253 */
                    {
                        uint32_t u32Tmp2;

                        u32Tmp2 = (u32Tmp << 1) * u32NF;

                        if ((u32Tmp2 >= FREQ_144MHZ) && (u32Tmp2 <= FREQ_500MHZ))   /* Constraint 3: 144MHz < FVCO < 500MHz */
                        {
                            uint32_t u32Tmp3;
                            uint32_t u32Tmp4;

                            u32Tmp3 = u32Tmp2 / au8NoTbl[u32NO];

                            if (u32FRDIV)
                            {
                                u32Tmp3 = u32Tmp3 + ((u32Tmp >> 11) * u32FRDIV / au8NoTbl[u32NO]);
                            }

                            u32Tmp4 = u32Tmp3;

                            u32Tmp3 = (u32Tmp3 > u32PllFreq) ? (u32Tmp3 - u32PllFreq) : (u32PllFreq - u32Tmp3);

                            if (u32Tmp3 < u32Min)
                            {
                                u32Min = u32Tmp3;
                                u32MinNR = u32NR;
                                u32MinNF = u32NF;
                                u32MinFRDIV = u32FRDIV;
                                u32BestFreq = u32Tmp4;

                                /* Break when get good results */
                                if (u32Min == 0UL)
                                {
                                    break;
                                }
                            }
                        }
                    }
                }
            }
        }

        if (u32PllSelect == CLK_APLL0_SELECT)
        {
            /* Apply new PLL0 setting. */
            CLK->APLL0CTL = (u32NO << CLK_APLL0CTL_OUTDIV_Pos) |
                            (u32StableSel) |
                            ((u32MinNR - 1UL) << CLK_APLL0CTL_INDIV_Pos) |
                            ((u32MinNF - 2UL) << CLK_APLL0CTL_FBDIV_Pos) |
                            ((u32MinFRDIV) << CLK_APLL0CTL_FRDIV_Pos);

            /* Apply PLL0 Clock Source */
            CLK->APLL0SEL = (CLK->APLL0SEL & ~CLK_APLL0SEL_APLLSRC_Msk) | (u32PllClkSrc << CLK_APLL0SEL_APLLSRC_Pos);

            /* Enable PLL0 */
            CLK->SRCCTL |= CLK_SRCCTL_APLL0EN_Msk;
        }
        else
        {
            /* Apply new PLL1 setting. */
            CLK->APLL1CTL = (u32NO << CLK_APLL1CTL_OUTDIV_Pos) |
                            (u32StableSel) |
                            ((u32MinNR - 1UL) << CLK_APLL1CTL_INDIV_Pos) |
                            ((u32MinNF - 2UL) << CLK_APLL1CTL_FBDIV_Pos) |
                            ((u32MinFRDIV) << CLK_APLL1CTL_FRDIV_Pos);

