OpenNuvoton/M55M1BSP/Library/StdDriver/src/clk.c
    /* Get clock divider control register address */
    u32DivAddr = (uint32_t)MODULE_CLKDIV_BASE + ((uint32_t)MODULE_CLKDIV(u64ModuleIdx) << 2);

    /* Get clock divider number setting */
    u32DivVal = (inpw((uint32_t *)u32DivAddr) & (uint32_t)(MODULE_CLKDIV_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx))) >> (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx);

    return u32DivVal;
}

/**
  * @brief      Set system and bus clock
  * @param[in]  u32SCLKSrc is SCLK clock source. Including :
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_MIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC48M
  *             - \ref CLK_SCLKSEL_SCLKSEL_HXT
  *             - \ref CLK_SCLKSEL_SCLKSEL_APLL0
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_APLLCTL_APLLSRC_HXT
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC48_DIV4
  *             u32PllClkSrc is ignored when u32SCLKSrc is not CLK_SCLKSEL_SCLKSEL_APLL0.
  * @param[in]  u32PllFreq is PLL frequency. The range of u32PllFreq is 50 MHz ~ 500 MHz.
  *             u32PllFreq is ignored when u32SCLKSrc is not CLK_SCLKSEL_SCLKSEL_APLL0.
  * @return     Current SCLK frequency
  * @details    This function is used to set the SCLK/HCLK/PCLK with clock limitations. \n
  *             The clock limitation as following below :
  *             The maximum SCLK is 220 MHz.
  *             The maximum HCLK0/HCLK1 is SCLK
  *             The maximum HCLK2 is SCLK/2
  *             The maximum PCLK0/PCLK1/PCLK2/PCLK3 is SCLK/2
  *             The maximum PCLK4 is HCLK2/2
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_SetBusClock(uint32_t u32SCLKSrc, uint32_t u32PllClkSrc, uint32_t u32PllFreq)
{
    if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_APLL0)
    {
        uint32_t u32PllFreqTmp = u32PllFreq;

        /* Select SCLK to HIRC before APLL setting*/
        CLK_SetSCLK(CLK_SCLKSEL_SCLKSEL_HIRC);

        /* Maximum frequency limit */
        if (u32PllFreqTmp > FREQ_220MHZ)
        {
            u32PllFreqTmp = FREQ_220MHZ;
        }

        /* Enable APLL0 clock */
        (void)CLK_EnableAPLL(u32PllClkSrc, u32PllFreqTmp, CLK_APLL0_SELECT);
    }
    else
    {
        if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_MIRC)
        {
            /* Enable internal medium speed RC clock */
            CLK_EnableXtalRC(CLK_SRCCTL_MIRCEN_Msk);

            /* Waiting for internal medium speed clock ready */
            (void)CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);
        }
        else if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_HIRC48M)
        {
            /* Enable internal RC 48MHz clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HIRC48MEN_Msk);

            /* Waiting for internal RC 48MHz clock ready */
            (void)CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);
        }
        else if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_HXT)
        {
            /* Enable external high speed crystal clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HXTEN_Msk);

            /* Waiting for external high speed crystal clock ready */
            (void)CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);
        }
        else
        {
            /* Enable Internal RC 12MHz clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HIRCEN_Msk);

            /* Waiting for Internal RC clock ready */
            (void)CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
        }

        /* Release clock limitations */
        CLK_SET_HCLK2DIV(1);
        CLK_SET_PCLK0DIV(1);
        CLK_SET_PCLK1DIV(1);
        CLK_SET_PCLK2DIV(1);
        CLK_SET_PCLK3DIV(1);
        CLK_SET_PCLK4DIV(1);
    }

    /* Switch SCLK clock */
    CLK_SetSCLK(u32SCLKSrc);

    return SystemCoreClock;
}

/**
  * @brief      This function execute delay function.
  * @param[in]  us  Delay time. The Max value is 2^24 / CPU Clock(MHz). Ex:
  *                             200MHz => 83886us, 180MHz => 93206us ...
  * @return     None
  * @details    Use the SysTick to generate the delay time and the unit is in us.
  *             The SysTick clock source is from HCLK, i.e the same as system core clock.
  *             User can use SystemCoreClockUpdate() to calculate CyclesPerUs automatically before using this function.
  */
void CLK_SysTickDelay(uint32_t us)
{
    /* Systick function is using and clock source is core clock */
    if ((SysTick->CTRL & (SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk)) == (SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk))
    {
        uint32_t u32TargetValue;
        uint32_t u32TargetInt;
        uint32_t u32TargetRem;
        uint32_t u32DelayCycles;
        uint32_t SysTickValue;

        u32DelayCycles = us * CyclesPerUs;

        if (u32DelayCycles > SysTick->LOAD)
        {
            /* Calculate re-load cycles with current SysTick->LOAD */
            u32TargetInt = u32DelayCycles / SysTick->LOAD;

            /* Calculate remainder delay cycles */
            u32TargetRem = u32DelayCycles % SysTick->LOAD;
        }
        else
        {
            u32TargetInt = 0;
            u32TargetRem = u32DelayCycles;
        }

        SysTickValue = SysTick->VAL;

        if (u32TargetRem > SysTickValue)
        {
            u32TargetValue = SysTick->LOAD;
            u32TargetValue = u32TargetValue - (u32TargetRem - SysTickValue);
            u32TargetInt++;
        }
        else
        {
            u32TargetValue = SysTickValue - u32TargetRem;
        }

        while (u32TargetInt > 0UL)
        {
            /* Wait for the countdown to reach zero */
            while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0UL)
            {
            }

            u32TargetInt--;
        }

        /* Wait for the countdown to reach the target value */
        while (SysTick->VAL > u32TargetValue)
        {
            /* Current value has been reloaded */
            if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk)
            {
                break;
            }
        }
    }
    else
    {
        SysTick->LOAD = us * CyclesPerUs;
        SysTick->VAL  = 0x0UL;
        SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;

        /* Waiting for down-count to zero */
        while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0UL)
        {
        }

        /* Disable SysTick counter */
        SysTick->CTRL = 0UL;
    }
}

/**
  * @brief      This function execute long delay function.
  * @param[in]  us  Delay time.
  * @return     None
  * @details    Use the SysTick to generate the long delay time and the UNIT is in us.
  *             The SysTick clock source is from HCLK, i.e the same as system core clock.
  *             User can use SystemCoreClockUpdate() to calculate CyclesPerUs automatically before using this function.
  */
void CLK_SysTickLongDelay(uint32_t us)
{
    uint32_t u32Delay;
    uint32_t u32Temp_us = us;
    /* It should <= 65536us for each delay loop */
    u32Delay = 65536UL;

    do
    {
        if (u32Temp_us > u32Delay)
        {
            u32Temp_us -= u32Delay;
        }
        else
        {
            u32Delay = u32Temp_us;
            u32Temp_us = 0UL;
        }

        SysTick->LOAD = u32Delay * CyclesPerUs;
        SysTick->VAL  = (0x0UL);
        SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;

        /* Waiting for down-count to zero */
        while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0UL) {}

        /* Disable SysTick counter */
        SysTick->CTRL = 0UL;
    } while (u32Temp_us > 0UL);
}

/** @} end of group CLK_EXPORTED_FUNCTIONS */
/** @} end of group CLK_Driver */
/** @} end of group Standard_Driver */
